# language: ru

Функционал: Страница авторизации

  @tag
  Сценарий: Тест_1
    Пусть пользователь перешел на страницу "https://vk.ru"
    Тогда система находится в состоянии ожидания 2 секунд
    Тогда на главной странице отображается заголовок "Вход ВКонтакте"
    Тогда на главной странице отображаются кнопки:
      | Создать страницу для бизнеса |
      | Подробнее                    |
      | Войти другим способом        |
      | Создать аккаунт              |
    # Проверка страницы с авторизацией по номеру
    Пусть пользователь нажал на кнопку "Войти другим способом"
    Тогда на главной странице отображается заголовок "Вход ВКонтакте"
    И отображаются кнопки выбора входа на сайт:
      | Телефон |
      | Почта   |
    И на главной странице отображаются кнопки:
      | Создать страницу для бизнеса |
      | Войти                        |
      | Создать аккаунт              |
      | QR-код                       |
    И на главной странице активна кнопка входа "Телефон"
    И отображается окно ввода номера телефона для авторизации
    Пусть пользователь ввел номер телефона для входа "9777777777"
    Когда пользователь нажал на кнопку "Войти"
    Тогда открывается страница с текстом "Введите парольОт аккаунта VK ID с номером +7 ··· ··· ·· 77"
    И отображается поле ввода пароля "Введите пароль"
    И на главной странице отображаются кнопки:
      | Продолжить |
      | Помощь     |
    Когда пользователь ввел пароль авторизации "123abc123ABC" в поле "Введите пароль"
    И пользователь нажал на кнопку "Продолжить"
    Тогда отображается ошибка "Неверный пароль"
    Пусть пользователь вернулся назад на страницу
    Тогда на главной странице отображается заголовок "Вход ВКонтакте"
    # Проверка страницы с созданием аккаунта
    Когда пользователь нажал на кнопку "Создать аккаунт"
    Тогда открывается страница с текстом "Создание аккаунтаВаш номер телефона будет использоваться для входа в аккаунт"
    И отображается окно ввода номера телефона для авторизации
    Пусть пользователь ввел номер телефона для входа "9000000000"
#    И пользователь нажал на кнопку "Продолжить"
